src/templates/v201809/userList.xml.twig

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"
            xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <RequestHeader xmlns="https://ddp.googleapis.com/api/ddp/provider/v201809">
            <clientCustomerId>{{ clientCustomerId }}</clientCustomerId>
        </RequestHeader>
    </S:Header>
    <S:Body>
        <mutate xmlns="https://ddp.googleapis.com/api/ddp/provider/v201809">
            <operations>
                <operator>{{ operator }}</operator>
                <operand xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                         xsi:type="BasicUserList">
                    <id>{{ id }}</id>
                    <name>{{ name }}</name>
                    <description>{{ description }}</description>
                    <status>{{ status }}</status>
                    <integrationCode>{{ integrationCode }}</integrationCode>
                    <accountUserListStatus>{{ accountUserListStatus }}</accountUserListStatus>
                    <membershipLifeSpan>{{ membershipLifeSpan }}</membershipLifeSpan>
                    <accessReason>{{ accessReason }}</accessReason>
                    <isEligibleForSearch>{{ isEligibleForSearch }}</isEligibleForSearch>
                </operand>
            </operations>
        </mutate>
    </S:Body>
</S:Envelope>
